# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [3,4, 4,9, 7,6]  # P3/8
  - [7,13, 15,9, 13,18]  # P4/16
  - [28,15, 22,30, 50,37]  # P5/32

# yolov7 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, ODConv2d, [32, 3, 1]],  # 0
  
   [-1, 1, ODConv2d, [64, 3, 2]],  # 1-P1/2
   [-1, 1, ODConv2d, [64, 3, 1]],
   
   [-1, 1, ODConv2d, [128, 3, 2]],  # 3-P2/4
   [-1, 1, ODConv2d, [64, 1, 1, 0]],
   [-2, 1, ODConv2d, [64, 1, 1, 0]],
   [-1, 1, ODConv2d, [64, 3, 1]],
   [-1, 1, ODConv2d, [64, 3, 1]],
   [-1, 1, ODConv2d, [64, 3, 1]],
   [-1, 1, ODConv2d, [64, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, ODConv2d, [256, 1, 1, 0]],  # 11
         
   [-1, 1, MP, []],
   [-1, 1, ODConv2d, [128, 1, 1, 0]],
   [-3, 1, ODConv2d, [128, 1, 1, 0]],
   [-1, 1, ODConv2d, [128, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 16-P3/8  
   [-1, 1, ODConv2d, [128, 1, 1, 0]],
   [-2, 1, ODConv2d, [128, 1, 1, 0]],
   [-1, 1, ODConv2d, [128, 3, 1]],
   [-1, 1, ODConv2d, [128, 3, 1]],
   [-1, 1, ODConv2d, [128, 3, 1]],
   [-1, 1, ODConv2d, [128, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, ODConv2d, [512, 1, 1, 0]],  # 24
         
   [-1, 1, MP, []],
   [-1, 1, ODConv2d, [256, 1, 1, 0]],
   [-3, 1, ODConv2d, [256, 1, 1, 0]],
   [-1, 1, ODConv2d, [256, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 29-P4/16  
   [-1, 1, ODConv2d, [256, 1, 1, 0]],
   [-2, 1, ODConv2d, [256, 1, 1, 0]],
   [-1, 1, ODConv2d, [256, 3, 1]],
   [-1, 1, ODConv2d, [256, 3, 1]],
   [-1, 1, ODConv2d, [256, 3, 1]],
   [-1, 1, ODConv2d, [256, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, ODConv2d, [1024, 1, 1, 0]],  # 37
         
   [-1, 1, MP, []],
   [-1, 1, ODConv2d, [512, 1, 1, 0]],
   [-3, 1, ODConv2d, [512, 1, 1, 0]],
   [-1, 1, ODConv2d, [512, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 42-P5/32  
   [-1, 1, ODConv2d, [256, 1, 1, 0]],
   [-2, 1, ODConv2d, [256, 1, 1, 0]],
   [-1, 1, ODConv2d, [256, 3, 1]],
   [-1, 1, ODConv2d, [256, 3, 1]],
   [-1, 1, ODConv2d, [256, 3, 1]],
   [-1, 1, ODConv2d, [256, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, ODConv2d, [1024, 1, 1, 0]],  # 50
  ]

# yolov7 head
head:
  [[-1, 1, SPPCSPC, [512]], # 51
  
   [-1, 1, ODConv2d, [256, 1, 1, 0]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [37, 1, ODConv2d, [256, 1, 1, 0]], # route backbone P4
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, ODConv2d, [256, 1, 1, 0]],
   [-2, 1, ODConv2d, [256, 1, 1, 0]],
   [-1, 1, ODConv2d, [128, 3, 1]],
   [-1, 1, ODConv2d, [128, 3, 1]],
   [-1, 1, ODConv2d, [128, 3, 1]],
   [-1, 1, ODConv2d, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, ODConv2d, [256, 1, 1, 0]], # 63
   
   [-1, 1, ODConv2d, [128, 1, 1, 0]],
   [-1, 1, nn.Upsample, [None, 4, 'nearest']],
   [11, 1, ODConv2d, [128, 1, 1, 0]], # route backbone P3
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, ODConv2d, [128, 1, 1, 0]],
   [-2, 1, ODConv2d, [128, 1, 1, 0]],
   [-1, 1, ODConv2d, [64, 3, 1]],
   [-1, 1, ODConv2d, [64, 3, 1]],
   [-1, 1, ODConv2d, [64, 3, 1]],
   [-1, 1, ODConv2d, [64, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, ODConv2d, [128, 1, 1, 0]], # 75
      
   [-1, 1, MP, []],                 # 76
   [-1, 1, ODConv2d, [128, 3, 2]],      # 77
   [-3, 1, ODConv2d, [128, 1, 1, 0]],      # 78
   [-1, 1, ODConv2d, [128, 3, 4]],      # 79
   [[-1, -3, 63], 1, Concat, [1]],  # 80
   
   [-1, 1, ODConv2d, [256, 1, 1, 0]],
   [-2, 1, ODConv2d, [256, 1, 1, 0]],
   [-1, 1, ODConv2d, [128, 3, 1]],
   [-1, 1, ODConv2d, [128, 3, 1]],
   [-1, 1, ODConv2d, [128, 3, 1]],
   [-1, 1, ODConv2d, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, ODConv2d, [256, 1, 1, 0]], # 88
      
   [-1, 1, MP, []],
   [-1, 1, ODConv2d, [256, 1, 1, 0]],
   [-3, 1, ODConv2d, [256, 1, 1, 0]],
   [-1, 1, ODConv2d, [256, 3, 2]],
   [[-1, -3, 51], 1, Concat, [1]],
   
   [-1, 1, ODConv2d, [512, 1, 1, 0]],
   [-2, 1, ODConv2d, [512, 1, 1, 0]],
   [-1, 1, ODConv2d, [256, 3, 1]],
   [-1, 1, ODConv2d, [256, 3, 1]],
   [-1, 1, ODConv2d, [256, 3, 1]],
   [-1, 1, ODConv2d, [256, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, ODConv2d, [512, 1, 1, 0]], # 101
   
   [75, 1, RepConv, [256, 3, 1]],
   [88, 1, RepConv, [512, 3, 1]],
   [101, 1, RepConv, [1024, 3, 1]],

   [[102,103,104], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
